app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if (User.exists?(user_id: @user.user_id)) || (@user.user_id == "")
      redirect_to new_user_path
      flash[:notice] = "This User ID is already exists!!"
    else
      @user.save
---
SELECT  1 AS one FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "12"]]
INSERT INTO "users" ("user_id", "email", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "13"], ["email", "TEST"], ["session_token", "sss"], ["created_at", "2016-09-27 13:21:32.700198"], ["updated_at", "2016-09-27 13:21:32.700198"]]